mini_project/app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("name", "meal_type", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Test Food"], ["meal_type", "Appetizers"], ["user_id", 9], ["created_at", "2020-11-03 19:31:29.721849"], ["updated_at", "2020-11-03 19:31:29.721849"]]
---
  def create
    @recipe = Recipe.new(recipe_params)
    if @recipe.save

UPDATE "recipes" SET "user_id" = ?, "name" = ?, "meal_type" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["user_id", 3], ["name", "Pork Sausage Roll with Nutella"], ["meal_type", "Appetizers"], ["updated_at", "2020-11-03 19:37:10.590696"], ["id", 2]]
---
  def update
    @recipe.update(recipe_params)