mini_project/app/views/recipes/edit.html.erb

  <%= f.label :user %>
  <%= f.collection_select :user_id, User.all, :id, :name %>
---
SELECT "users".* FROM "users"