mini_project/app/views/recipes/new.html.erb

SELECT "users".* FROM "users"
---
  <%= f.label :user %>
  <%= f.collection_select :user_id, User.all, :id, :name %>