mini_project/app/views/recipes/show.html.erb

<ul>
  <% @recipe.recipe_ingredients.each do |i| %>
---
SELECT "recipe_ingredients".* FROM "recipe_ingredients" WHERE "recipe_ingredients"."recipe_id" = ?  [["recipe_id", 1]]